_posts/2013-06-18-hop-comments.html
---
category: computer science and enginneering
layout: post
title: "Notes of HOP"
Tags: ["Big Data", Hadoop, HOP]
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">HOP 对hadoop修改的内容</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>添加了org.apache.hadoop.mapred.buffer，包括OutputFile(类)，Manager(类),BufferUmbilicalProtocol(接口),
</li>
<li>添加了org.apache.hadoop.mapred.buffer.impl，包括了JOutputBuffer
</li>
</ul>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #b5bd68;">public</span> <span style="color: #b5bd68;">class</span> <span style="color: #81a2be;">JOutputBuffer</span>&lt;<span style="color: #81a2be;">K</span> <span style="color: #b5bd68;">extends</span> <span style="color: #81a2be;">Object</span>, <span style="color: #81a2be;">V</span> <span style="color: #b5bd68;">extends</span> <span style="color: #81a2be;">Object</span>&gt; 
        <span style="color: #b5bd68;">extends</span> <span style="color: #81a2be;">Buffer</span>&lt;<span style="color: #81a2be;">K</span>, <span style="color: #81a2be;">V</span>&gt;
                <span style="color: #b5bd68;">implements</span> <span style="color: #81a2be;">OutputCollector</span>&lt;<span style="color: #81a2be;">K</span>, <span style="color: #81a2be;">V</span>&gt;, <span style="color: #81a2be;">IndexedSortable</span> {
        }
</pre>
</div>
<p>
在MapTask和ReduceTask中，添加了根据应用程序是否设置pipeline，来调用实例化JOutputBuffer，进而使用push或原来的pull方法，在map和reduce之间传递数据。
</p>

<p>
在运行TaskRunner的run方法时，org.apache.hadoop.mapred.child通过使用下面的方法进行了注册
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Add main class and its arguments </span>
        vargs.add(Childx.<span style="color: #b5bd68;">class</span>.getName());  <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">main of Child</span>
</pre>
</div>
<p>
在TaskTrack的run方法中调用 offerService()方法， offerService()调用addToTaskQueue((LaunchTaskAction)action)方法。
</p>

<p>
在addToTaskQueue方法中调用registerTask方法
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #b5bd68;">public</span> <span style="color: #81a2be;">void</span> <span style="color: #de935f;">addToTaskQueue</span>(<span style="color: #81a2be;">LaunchTaskAction</span> <span style="color: #f0c674;">action</span>) {
        <span style="color: #81a2be;">TaskInProgress</span> <span style="color: #f0c674;">tip</span> = registerTask(action, <span style="color: #b5bd68;">this</span>);
}
</pre>
</div>
<p>
在registerTask方法中创建了TaskInProgress实例
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #b5bd68;">private</span> <span style="color: #81a2be;">TaskInProgress</span> <span style="color: #de935f;">registerTask</span>(<span style="color: #81a2be;">LaunchTaskAction</span> <span style="color: #f0c674;">action</span>, 
        <span style="color: #81a2be;">TaskLauncher</span> <span style="color: #f0c674;">launcher</span>) {
                <span style="color: #81a2be;">Task</span> <span style="color: #f0c674;">t</span> = action.getTask();
                        <span style="color: #81a2be;">TaskInProgress</span> <span style="color: #f0c674;">tip</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">TaskInProgress</span>(t, <span style="color: #b5bd68;">this</span>.fConf, launcher);
                }
</pre>
</div>
<p>
通过
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #81a2be;">Task</span> <span style="color: #f0c674;">t</span> = action.getTask();
</pre>
</div>
<p>
可以看出具体是什么类型的task。
</p>

<p>
<i>org.apache.hadoop.ipc.Client$Connection</i> 的run方法调用receiveResponse()方法,receiveResponse()调用 <i>org.apache.hadoop.io.ObjectWritable</i> 的readFields(in)方法,进而调用readObject()方法,readObject()调用 <i>org.apache.hadoop.mapred.HeartbeatResponse的readFields()</i>
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #b5bd68;">public</span> <span style="color: #81a2be;">void</span> <span style="color: #de935f;">readFields</span>(<span style="color: #81a2be;">DataInput</span> <span style="color: #f0c674;">in</span>) <span style="color: #b5bd68;">throws</span> <span style="color: #81a2be;">IOException</span> {
        <span style="color: #b5bd68;">this</span>.responseId = in.readShort();
                <span style="color: #b5bd68;">this</span>.heartbeatInterval = in.readInt();
                        <span style="color: #81a2be;">int</span> <span style="color: #f0c674;">length</span> = WritableUtils.readVInt(in);
                        <span style="color: #b5bd68;">if</span> (length &gt; 0) {
                                actions = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">TaskTrackerAction</span>[length];
                                        <span style="color: #b5bd68;">for</span> (<span style="color: #81a2be;">int</span> <span style="color: #f0c674;">i</span>=0; i &lt; <span style="color: #81a2be;">length</span>; ++i) {
                                                <span style="color: #81a2be;">TaskTrackerAction</span>.<span style="color: #81a2be;">ActionType</span> <span style="color: #f0c674;">actionType</span> = 
                                                        WritableUtils.readEnum(in, <span style="color: #81a2be;">TaskTrackerAction</span>.ActionType.<span style="color: #b5bd68;">class</span>);
                                                                actions[i] = TaskTrackerAction.createAction(actionType);
                                                        actions[i].readFields(in);
                                                }
                                        ...
                                }
</pre>
</div>
<p>
在这个方法中，创建了TaskTrackerAction实例actions，根据ActionType的类型调用相应的动作，以LAUNCH_TASK为例，它就会调用 <i>org.apache.hadoop.mapred.LaunchTaskAction</i> 的readFields()方法。
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #b5bd68;">public</span> <span style="color: #81a2be;">void</span> <span style="color: #de935f;">readFields</span>(<span style="color: #81a2be;">DataInput</span> <span style="color: #f0c674;">in</span>) <span style="color: #b5bd68;">throws</span> <span style="color: #81a2be;">IOException</span> {

          <span style="color: #81a2be;">boolean</span> <span style="color: #f0c674;">isMapTask</span> = in.readBoolean();
          <span style="color: #81a2be;">boolean</span> <span style="color: #f0c674;">isPipeline</span> = in.readBoolean();
                  <span style="color: #b5bd68;">if</span> (isMapTask) {
                          task = isPipeline ? <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">PipelineMapTask</span>() : <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">MapTask</span>();
                  } <span style="color: #b5bd68;">else</span> {
                          task = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">ReduceTask</span>();
                  }
                          task.readFields(in);
                  }
          }
</pre>
</div>
<p>
在这个方法中，就确定了是要启动MapTask还是ReduceTask
</p>

<p>
在TaskInProgress的task成员是如何与TaskRunner联系起来的，在有mapreduce任务时，怎么触发TaskRunner中的run方法?
</p>

<p>
根据上面的解释，知道task是MapTask或ReduceTask，因此在运行到TaskTracker的launchTask时，task.createRunner()就会去执行，MapTask中的createRunner()方法: (在TaskTracker中，launchTaskForJob-&gt;launchTask-&gt;this.runner = task.createRunner(TaskTracker.this, this);)
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #81a2be;">@Override</span>
        <span style="color: #b5bd68;">public</span> <span style="color: #81a2be;">TaskRunner</span> <span style="color: #de935f;">createRunner</span>(<span style="color: #81a2be;">TaskTracker</span> <span style="color: #f0c674;">tracker</span>, <span style="color: #81a2be;">TaskTracker</span>.<span style="color: #81a2be;">TaskInProgress</span> <span style="color: #f0c674;">tip</span>) {
                <span style="color: #b5bd68;">return</span> <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">MapTaskRunner</span>(tip, tracker, <span style="color: #b5bd68;">this</span>.conf);
        }
</pre>
</div>
<p>
从类的关系知道，MapTaskRunner继承自TaskRunner，因此当task需要运行run方法时，就去执行TaskRunner的run方法。
</p>

<p>
在 hadoop-hop-0.2/logs/hadoop-abelard-tasktracker-dillon.cloud.log开始的那些行
</p>

<div class="org-src-container">

<pre class="src src-java">2012-02-11 19:36:37,110 INFO <span style="color: #81a2be;">org</span>.<span style="color: #81a2be;">apache</span>.<span style="color: #81a2be;">hadoop</span>.<span style="color: #81a2be;">mapred</span>.TaskTracker: STARTUP_MSG: 

<span style="color: #b294bb;">/************************************************************/</span>

STARTUP_MSG: 

STARTUP_MSG:   host = dillon.cloud/192.168.0.88

STARTUP_MSG:   args = []

STARTUP_MSG:   version = 0.2

STARTUP_MSG:   build =  -r ; <span style="color: #81a2be;">compiled</span> <span style="color: #f0c674;">by</span> <span style="color: #8abeb7;">'abelard'</span> on Sat Feb 11 19:35:32 CST 2012
</pre>
</div>
<p>
出自：org.apache.hadoop.util.StringUtils的startupShutdownMessage()方法。因此分别在JobTrack和TaskTrack的main()方法中，见到对startupShutdownMessage()方法的调用。
</p>
</div>
</div>
